tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf18323_tdd.h
#define IOCAP1                        522
#define IOCAP2                        523
#define IOCAP3                        524
#define IOCAP4                        525
#define IOCAP5                        526
#define IOCAN                         527
#define IOCAN0                        528
#define IOCAN1                        529
#define IOCAN2                        530
#define IOCAN3                        531
#define IOCAN4                        532
#define IOCAN5                        533
#define IOCAF                         534
#define IOCAF0                        535
#define IOCAF1                        536
#define IOCAF2                        537
#define IOCAF3                        538
#define IOCAF4                        539
#define IOCAF5                        540
#define IOCCP                         541
#define IOCCP0                        542
#define IOCCP1                        543
#define IOCCP2                        544
#define IOCCP3                        545
#define IOCCP4                        546
#define IOCCP5                        547
#define IOCCN                         548
#define IOCCN0                        549
#define IOCCN1                        550
#define IOCCN2                        551
#define IOCCN3                        552
#define IOCCN4                        553
#define IOCCN5                        554
#define IOCCF                         555
#define IOCCF0                        556
#define IOCCF1                        557
#define IOCCF2                        558
#define IOCCF3                        559
#define IOCCF4                        560
#define IOCCF5                        561
#define CLKRCON                       562
#define CLKRDIV                       563
#define CLKRDIV0                      564
#define CLKRDIV1                      565
#define CLKRDIV2                      566
#define CLKRDC                        567
#define CLKRDC0                       568
#define CLKRDC1                       569
#define CLKREN                        570
#define MDCON                         571
#define MDBIT                         572
#define MDOUT                         573
#define MDOPOL                        574
#define MDEN                          575
#define MDSRC                         576
#define MDMS0                         577
#define MDMS                          578
#define MDMS1                         579
#define MDMS2                         580
#define MDMS3                         581
#define MDCARH                        582
#define MDCH                          583
#define MDCH0                         584
#define MDCH1                         585
#define MDCH2                         586
#define MDCH3                         587
#define MDCHSYNC                      588
#define MDCHPOL                       589
#define MDCARL                        590
#define MDCL0                         591
#define MDCL                          592
#define MDCL1                         593
#define MDCL2                         594
#define MDCL3                         595
#define MDCLSYNC                      596
#define MDCLPOL                       597
#define CCDNA                         598
#define CCDNA0                        599
#define CCDNA1                        600
#define CCDNA2                        601
#define CCDNA4                        602
#define CCDNA5                        603
#define CCDNC                         604
#define CCDNC0                        605
#define CCDNC1                        606
#define CCDNC2                        607
#define CCDNC3                        608
#define CCDNC4                        609
#define CCDNC5                        610
#define CCDCON                        611
#define CCDS                          612
#define CCDS0                         613
#define CCDS1                         614
#define CCDEN                         615
#define CCDPA                         616
#define CCDPA0                        617
#define CCDPA1                        618
#define CCDPA2                        619
#define CCDPA4                        620
#define CCDPA5                        621
#define CCDPC                         622
#define CCDPC0                        623
#define CCDPC1                        624
#define CCDPC2                        625
#define CCDPC3                        626
#define CCDPC4                        627
#define CCDPC5                        628
#define NCO1ACCL                      629
#define NCO1ACCL_NCO1ACC              630
#define NCO1ACCH                      631
#define NCO1ACCH_NCO1ACC              632
#define NCO1ACCU                      633
#define NCO1ACCU_NCO1ACC              634
#define NCO1INCL                      635
#define NCO1INCL_NCO1INC              636
#define NCO1INCH                      637
#define NCO1INCH_NCO1INC              638
#define NCO1INCU                      639
#define NCO1INCU_NCO1INC              640
#define NCO1CON                       641
#define N1PFM                         642
#define N1POL                         643
#define N1OUT                         644
#define N1EN                          645
#define NCO1CLK                       646
#define N1CKS                         647
#define N1PWS                         648
#define PWM5DCL                       649
#define PWM5DCL0                      650
#define PWM5DCL1                      651
#define PWM5DCH                       652
#define PWM5DCH0                      653
#define PWM5DCH1                      654
#define PWM5DCH2                      655
#define PWM5DCH3                      656
#define PWM5DCH4                      657
#define PWM5DCH5                      658
#define PWM5DCH6                      659
#define PWM5DCH7                      660
#define PWM5CON                       661
#define PWM5POL                       662
#define PWM5OUT                       663
#define PWM5EN                        664
#define PWM6DCL                       665
#define PWM6DCL0                      666
#define PWM6DCL1                      667
#define PWM6DCH                       668
#define PWM6DCH0                      669
#define PWM6DCH1                      670
#define PWM6DCH2                      671
#define PWM6DCH3                      672
#define PWM6DCH4                      673
#define PWM6DCH5                      674
#define PWM6DCH6                      675
#define PWM6DCH7                      676
#define PWM6CON                       677
#define PWM6POL                       678
#define PWM6OUT                       679
#define PWM6EN                        680
#define CWG1CLKCON                    681
#define CS                            682
#define CWG1CS                        683
#define CWG1DAT                       684
#define DAT                           685
#define CWG1DAT0                      686
#define CWG1DAT1                      687
#define CWG1DAT2                      688
#define CWG1DAT3                      689
#define CWG1DBR0                      690
#define CWG1DBR                       691
#define DBR                           692
#define DBR0                          693
#define CWG1DBR1                      694
#define DBR1                          695
#define CWG1DBR2                      696
#define DBR2                          697
#define CWG1DBR3                      698
#define DBR3                          699
#define CWG1DBR4                      700
#define DBR4                          701
#define CWG1DBR5                      702
#define DBR5                          703
#define CWG1DBF                       704
#define CWG1DBF0                      705
#define DBF                           706
#define DBF0                          707
#define CWG1DBF1                      708
#define DBF1                          709
#define CWG1DBF2                      710
#define DBF2                          711
#define CWG1DBF3                      712
#define DBF3                          713
#define CWG1DBF4                      714
#define DBF4                          715
#define DBF5                          716
#define CWG1DBF5                      717
#define CWG1CON0                      718
#define CWG1MODE0                     719
#define CWG1CON0_MODE                 720
#define CWG1CON0_MODE0                721
#define CWG1MODE                      722
#define CWG1MODE1                     723
#define CWG1CON0_MODE1                724
#define CWG1MODE2                     725
#define CWG1CON0_MODE2                726
#define LD                            727
#define CWG1LD                        728
#define CWG1EN                        729
#define G1EN                          730
#define CWG1CON0_EN                   731
#define CWG1CON1                      732
#define CWG1POLA                      733
#define POLA                          734
#define CWG1POLB                      735
#define POLB                          736
#define CWG1POLC                      737
#define POLC                          738
#define CWG1POLD                      739
#define POLD                          740
#define IN                            741
#define CWG1IN                        742
#define CWG1AS0                       743
#define CWG1LSAC                      744
#define LSAC                          745
#define LSAC0                         746
#define CWG1LSAC0                     747
#define LSAC1                         748
#define CWG1LSAC1                     749
#define LSBD0                         750
#define CWG1LSBD0                     751
#define LSBD                          752
#define CWG1LSBD                      753
#define LSBD1                         754
#define CWG1LSBD1                     755
#define CWG1REN                       756
#define REN                           757
#define CWG1SHUTDOWN                  758
#define SHUTDOWN                      759
#define CWG1AS1                       760
#define AS0E                          761
#define AS1E                          762
#define AS2E                          763
#define AS3E                          764
#define CWG1STR                       765
#define CWG1STRA                      766
#define STRA                          767
#define STRB                          768
#define CWG1STRB                      769
#define CWG1STRC                      770
#define STRC                          771
#define CWG1STRD                      772
#define STRD                          773
#define OVRA                          774
#define CWG1OVRA                      775
#define CWG1OVRB                      776
#define OVRB                          777
#define OVRC                          778
#define CWG1OVRC                      779
#define OVRD                          780
#define CWG1OVRD                      781
#define NVMADR0                       782
#define NVMADRL                       783
#define NVMADR1                       784
#define NVMADR2                       785
#define NVMADR3                       786
#define NVMADR4                       787
#define NVMADR5                       788
#define NVMADR6                       789
#define NVMADR7                       790
#define NVMADR8                       791
#define NVMADRH                       792
#define NVMADR9                       793
#define NVMADR10                      794
#define NVMADR11                      795
#define NVMADR12                      796
#define NVMADR13                      797
#define NVMADR14                      798
#define NVMDAT0                       799
#define NVMDATL                       800
#define NVMDAT1                       801
#define NVMDAT2                       802
#define NVMDAT3                       803
#define NVMDAT4                       804
#define NVMDAT5                       805
#define NVMDAT6                       806
#define NVMDAT7                       807
#define NVMDAT8                       808
#define NVMDATH                       809
#define NVMDAT9                       810
#define NVMDAT10                      811
#define NVMDAT11                      812
#define NVMDAT12                      813
#define NVMDAT13                      814
#define NVMCON1                       815
#define RD                            816
#define WR                            817
#define WREN                          818
#define WRERR                         819
#define FREE                          820
#define LWLO                          821
#define NVMREGS                       822
#define NVMCON2                       823
#define NMVCON2                       824
#define PCON0                         825
#define nBOR                          826
#define nPOR                          827
#define nRI                           828
#define nRMCLR                        829
#define nRWDT                         830
#define STKUNF                        831
#define STKOVF                        832
#define PMD0                          833
#define IOCMD                         834
#define CLKRMD                        835
#define NVMMD                         836
#define FVRMD                         837
#define SYSCMD                        838
#define PMD1                          839
#define TMR0MD                        840
#define TMR1MD                        841
#define TMR2MD                        842
#define NCOMD                         843
#define PMD2                          844
#define CMP1MD                        845
#define CMP2MD                        846
#define ADCMD                         847
#define DACMD                         848
#define PMD3                          849
#define CCP1MD                        850
#define CCP2MD                        851
#define PWM5MD                        852
#define PWM6MD                        853
#define CWG1MD                        854
#define PMD4                          855
#define MSSP1MD                       856
#define UART1MD                       857
#define PMD5                          858
#define DSMMD                         859
#define CLC1MD                        860
#define CLC2MD                        861
#define CPUDOZE                       862
#define DOZE0                         863
#define DOZE                          864
#define DOZE1                         865
#define DOZE2                         866
#define DOE                           867
#define ROI                           868
#define DOZEN                         869
#define IDLEN                         870
#define OSCCON1                       871
#define NDIV0                         872
#define NDIV                          873
#define NDIV1                         874
#define NDIV2                         875
#define NDIV3                         876
#define NOSC0                         877
#define NOSC                          878
#define NOSC1                         879
#define NOSC2                         880
#define OSCCON2                       881
#define CDIV0                         882
#define CDIV                          883
#define CDIV1                         884
#define CDIV2                         885
#define CDIV3                         886
#define COSC                          887
#define COSC0                         888
#define COSC1                         889
#define COSC2                         890
#define OSCCON3                       891
#define NOSCR                         892
#define ORDY                          893
#define SOSCBE                        894
#define SOSCPWR                       895
#define CSWHOLD                       896
#define OSCSTAT1                      897
#define PLLR                          898
#define ADOR                          899
#define SOR                           900
#define LFOR                          901
#define HFOR                          902
#define EXTOR                         903
#define OSCEN                         904
#define ADOEN                         905
#define SOSCEN                        906
#define LFOEN                         907
#define HFOEN                         908
#define EXTOEN                        909
#define OSCTUNE                       910
#define HFTUN0                        911
#define HFTUN                         912
#define HFTUN1                        913
#define HFTUN2                        914
#define HFTUN3                        915
#define HFTUN4                        916
#define HFTUN5                        917
#define OSCFRQ                        918
#define HFFRQ                         919
#define HFFRQ0                        920
#define HFFRQ1                        921
#define HFFRQ2                        922
#define HFFRQ3                        923
#define PPSLOCK                       924
#define PPSLOCKED                     925
#define INTPPS0                       926
#define INTPPS                        927
#define INTPPS1                       928
#define INTPPS2                       929
#define INTPPS3                       930
#define INTPPS4                       931
#define T0CKIPPS0                     932
#define T0CKIPPS                      933
#define T0CKIPPS1                     934
#define T0CKIPPS2                     935
#define T0CKIPPS3                     936
#define T0CKIPPS4                     937
#define T1CKIPPS0                     938
#define T1CKIPPS                      939
#define T1CKIPPS1                     940
#define T1CKIPPS2                     941
#define T1CKIPPS3                     942
#define T1CKIPPS4                     943
#define T1GPPS0                       944
#define T1GPPS                        945
#define T1GPPS1                       946
#define T1GPPS2                       947
#define T1GPPS3                       948
#define T1GPPS4                       949
#define CCP1PPS0                      950
#define CCP1PPS                       951
#define CCP1PPS1                      952
#define CCP1PPS2                      953
#define CCP1PPS3                      954
#define CCP1PPS4                      955
#define CCP2PPS0                      956
#define CCP2PPS                       957
#define CCP2PPS1                      958
#define CCP2PPS2                      959
#define CCP2PPS3                      960
#define CCP2PPS4                      961
#define CWG1PPS0                      962
#define CWG1PPS                       963
#define CWG1PPS1                      964
#define CWG1PPS2                      965
#define CWG1PPS3                      966
#define CWG1PPS4                      967
#define MDCIN1PPS                     968
#define MDCIN1PPS0                    969
#define MDCIN1PPS1                    970
#define MDCIN1PPS2                    971
#define MDCIN1PPS3                    972
#define MDCIN1PPS4                    973
#define MDCIN2PPS0                    974
#define MDCIN2PPS                     975
#define MDCIN2PPS1                    976
#define MDCIN2PPS2                    977
#define MDCIN2PPS3                    978
#define MDCIN2PPS4                    979
#define MDMINPPS                      980
#define MDMINPPS0                     981
#define MDMINPPS1                     982
#define MDMINPPS2                     983
#define MDMINPPS3                     984
#define MDMINPPS4                     985
#define SSP1CLKPPS0                   986
#define SSP1CLKPPS                    987
#define SSP1CLKPPS1                   988
#define SSP1CLKPPS2                   989
#define SSP1CLKPPS3                   990
#define SSP1CLKPPS4                   991
#define SSP1DATPPS0                   992
#define SSP1DATPPS                    993
#define SSP1DATPPS1                   994
#define SSP1DATPPS2                   995
#define SSP1DATPPS3                   996
#define SSP1DATPPS4                   997
#define SSP1SSPPS                     998
#define SSP1SSPPS0                    999
#define SSP1SSPPS1                    1000
#define SSP1SSPPS2                    1001
#define SSP1SSPPS3                    1002
#define SSP1SSPPS4                    1003
#define RXPPS0                        1004
#define RXPPS                         1005
#define RXPPS1                        1006
#define RXPPS2                        1007
#define RXPPS3                        1008
#define RXPPS4                        1009
#define TXPPS0                        1010
#define TXPPS                         1011
#define TXPPS1                        1012
#define TXPPS2                        1013
#define TXPPS3                        1014
#define TXPPS4                        1015
#define CLCIN0PPS                     1016
#define CLCIN0PPS0                    1017
#define CLCIN0PPS1                    1018
#define CLCIN0PPS2                    1019
#define CLCIN0PPS3                    1020
#define CLCIN0PPS4                    1021
#define CLCIN1PPS0                    1022
#define CLCIN1PPS                     1023
#define CLCIN1PPS1                    1024
#define CLCIN1PPS2                    1025
#define CLCIN1PPS3                    1026
#define CLCIN1PPS4                    1027
#define CLCIN2PPS                     1028
#define CLCIN2PPS0                    1029
#define CLCIN2PPS1                    1030
#define CLCIN2PPS2                    1031
#define CLCIN2PPS3                    1032
#define CLCIN2PPS4                    1033
#define CLCIN3PPS                     1034
#define CLCIN3PPS0                    1035
#define CLCIN3PPS1                    1036
#define CLCIN3PPS2                    1037
#define CLCIN3PPS3                    1038
#define CLCIN3PPS4                    1039
#define RA0PPS                        1040
#define RA0PPS0                       1041
#define RA0PPS1                       1042
#define RA0PPS2                       1043
#define RA0PPS3                       1044
#define RA0PPS4                       1045
#define RA1PPS                        1046
#define RA1PPS0                       1047
#define RA1PPS1                       1048
#define RA1PPS2                       1049
#define RA1PPS3                       1050
#define RA1PPS4                       1051
#define RA2PPS0                       1052
#define RA2PPS                        1053
#define RA2PPS1                       1054
#define RA2PPS2                       1055
#define RA2PPS3                       1056
#define RA2PPS4                       1057
#define RA4PPS                        1058
#define RA4PPS0                       1059
#define RA4PPS1                       1060
#define RA4PPS2                       1061
#define RA4PPS3                       1062
#define RA4PPS4                       1063
#define RA5PPS                        1064
#define RA5PPS0                       1065
#define RA5PPS1                       1066
#define RA5PPS2                       1067
#define RA5PPS3                       1068
#define RA5PPS4                       1069
#define RC0PPS                        1070
#define RC0PPS0                       1071
#define RC0PPS1                       1072
#define RC0PPS2                       1073
#define RC0PPS3                       1074
#define RC0PPS4                       1075
#define RC1PPS0                       1076
#define RC1PPS                        1077
#define RC1PPS1                       1078
#define RC1PPS2                       1079
#define RC1PPS3                       1080
#define RC1PPS4                       1081
#define RC2PPS                        1082
#define RC2PPS0                       1083
#define RC2PPS1                       1084
#define RC2PPS2                       1085
#define RC2PPS3                       1086
#define RC2PPS4                       1087
#define RC3PPS                        1088
#define RC3PPS0                       1089
#define RC3PPS1                       1090
