tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf18323_tdd.h
#define RC3PPS2                       1091
#define RC3PPS3                       1092
#define RC3PPS4                       1093
#define RC4PPS0                       1094
#define RC4PPS                        1095
#define RC4PPS1                       1096
#define RC4PPS2                       1097
#define RC4PPS3                       1098
#define RC4PPS4                       1099
#define RC5PPS0                       1100
#define RC5PPS                        1101
#define RC5PPS1                       1102
#define RC5PPS2                       1103
#define RC5PPS3                       1104
#define RC5PPS4                       1105
#define CLCDATA                       1106
#define MLC1OUT                       1107
#define MLC2OUT                       1108
#define CLC1CON                       1109
#define CLC1CON_MODE0                 1110
#define LC1MODE                       1111
#define CLC1CON_MODE                  1112
#define LC1MODE0                      1113
#define CLC1CON_MODE1                 1114
#define LC1MODE1                      1115
#define LC1MODE2                      1116
#define CLC1CON_MODE2                 1117
#define LC1INTN                       1118
#define CLC1CON_INTN                  1119
#define CLC1CON_INTP                  1120
#define LC1INTP                       1121
#define LC1OUT                        1122
#define CLC1CON_OUT                   1123
#define CLC1CON_EN                    1124
#define LC1EN                         1125
#define CLC1POL                       1126
#define LC1G1POL                      1127
#define CLC1POL_G1POL                 1128
#define CLC1POL_G2POL                 1129
#define LC1G2POL                      1130
#define LC1G3POL                      1131
#define CLC1POL_G3POL                 1132
#define LC1G4POL                      1133
#define CLC1POL_G4POL                 1134
#define CLC1POL_POL                   1135
#define LC1POL                        1136
#define CLC1SEL0                      1137
#define CLC1SEL0_D1S0                 1138
#define LC1D1S                        1139
#define LC1D1S0                       1140
#define CLC1SEL0_D1S                  1141
#define CLC1SEL0_D1S1                 1142
#define LC1D1S1                       1143
#define CLC1SEL0_D1S2                 1144
#define LC1D1S2                       1145
#define CLC1SEL0_D1S3                 1146
#define LC1D1S3                       1147
#define CLC1SEL0_D1S4                 1148
#define LC1D1S4                       1149
#define CLC1SEL1                      1150
#define CLC1SEL1_D2S0                 1151
#define CLC1SEL1_D2S                  1152
#define LC1D2S                        1153
#define LC1D2S0                       1154
#define CLC1SEL1_D2S1                 1155
#define LC1D2S1                       1156
#define LC1D2S2                       1157
#define CLC1SEL1_D2S2                 1158
#define LC1D2S3                       1159
#define CLC1SEL1_D2S3                 1160
#define LC1D2S4                       1161
#define CLC1SEL1_D2S4                 1162
#define CLC1SEL2                      1163
#define LC1D3S0                       1164
#define CLC1SEL2_D3S                  1165
#define LC1D3S                        1166
#define CLC1SEL2_D3S0                 1167
#define LC1D3S1                       1168
#define CLC1SEL2_D3S1                 1169
#define LC1D3S2                       1170
#define CLC1SEL2_D3S2                 1171
#define LC1D3S3                       1172
#define CLC1SEL2_D3S3                 1173
#define LC1D3S4                       1174
#define CLC1SEL2_D3S4                 1175
#define CLC1SEL3                      1176
#define CLC1SEL3_D4S                  1177
#define LC1D4S                        1178
#define LC1D4S0                       1179
#define CLC1SEL3_D4S0                 1180
#define CLC1SEL3_D4S1                 1181
#define LC1D4S1                       1182
#define LC1D4S2                       1183
#define CLC1SEL3_D4S2                 1184
#define LC1D4S3                       1185
#define CLC1SEL3_D4S3                 1186
#define LC1D4S4                       1187
#define CLC1SEL3_D4S4                 1188
#define CLC1GLS0                      1189
#define CLC1GLS0_D1N                  1190
#define LC1G1D1N                      1191
#define CLC1GLS0_D1T                  1192
#define LC1G1D1T                      1193
#define LC1G1D2N                      1194
#define CLC1GLS0_D2N                  1195
#define LC1G1D2T                      1196
#define CLC1GLS0_D2T                  1197
#define CLC1GLS0_D3N                  1198
#define LC1G1D3N                      1199
#define CLC1GLS0_D3T                  1200
#define LC1G1D3T                      1201
#define CLC1GLS0_D4N                  1202
#define LC1G1D4N                      1203
#define CLC1GLS0_D4T                  1204
#define LC1G1D4T                      1205
#define CLC1GLS1                      1206
#define CLC1GLS1_D1N                  1207
#define LC1G2D1N                      1208
#define LC1G2D1T                      1209
#define CLC1GLS1_D1T                  1210
#define CLC1GLS1_D2N                  1211
#define LC1G2D2N                      1212
#define LC1G2D2T                      1213
#define CLC1GLS1_D2T                  1214
#define CLC1GLS1_D3N                  1215
#define LC1G2D3N                      1216
#define LC1G2D3T                      1217
#define CLC1GLS1_D3T                  1218
#define CLC1GLS1_D4N                  1219
#define LC1G2D4N                      1220
#define LC1G2D4T                      1221
#define CLC1GLS1_D4T                  1222
#define CLC1GLS2                      1223
#define CLC1GLS2_D1N                  1224
#define LC1G3D1N                      1225
#define LC1G3D1T                      1226
#define CLC1GLS2_D1T                  1227
#define LC1G3D2N                      1228
#define CLC1GLS2_D2N                  1229
#define LC1G3D2T                      1230
#define CLC1GLS2_D2T                  1231
#define CLC1GLS2_D3N                  1232
#define LC1G3D3N                      1233
#define LC1G3D3T                      1234
#define CLC1GLS2_D3T                  1235
#define LC1G3D4N                      1236
#define CLC1GLS2_D4N                  1237
#define LC1G3D4T                      1238
#define CLC1GLS2_D4T                  1239
#define CLC1GLS3                      1240
#define LC1G4D1N                      1241
#define CLC1GLS3_G4D1N                1242
#define LC1G4D1T                      1243
#define CLC1GLS3_G4D1T                1244
#define CLC1GLS3_G4D2N                1245
#define LC1G4D2N                      1246
#define CLC1GLS3_G4D2T                1247
#define LC1G4D2T                      1248
#define LC1G4D3N                      1249
#define CLC1GLS3_G4D3N                1250
#define LC1G4D3T                      1251
#define CLC1GLS3_G4D3T                1252
#define CLC1GLS3_G4D4N                1253
#define LC1G4D4N                      1254
#define CLC1GLS3_G4D4T                1255
#define LC1G4D4T                      1256
#define CLC2CON                       1257
#define LC2MODE0                      1258
#define CLC2CON_MODE                  1259
#define LC2MODE                       1260
#define CLC2CON_MODE0                 1261
#define LC2MODE1                      1262
#define CLC2CON_MODE1                 1263
#define LC2MODE2                      1264
#define CLC2CON_MODE2                 1265
#define LC2INTN                       1266
#define CLC2CON_INTN                  1267
#define LC2INTP                       1268
#define CLC2CON_INTP                  1269
#define CLC2CON_OUT                   1270
#define LC2OUT                        1271
#define CLC2CON_EN                    1272
#define LC2EN                         1273
#define CLC2POL                       1274
#define LC2G1POL                      1275
#define CLC2POL_G1POL                 1276
#define LC2G2POL                      1277
#define CLC2POL_G2POL                 1278
#define LC2G3POL                      1279
#define CLC2POL_G3POL                 1280
#define LC2G4POL                      1281
#define CLC2POL_G4POL                 1282
#define CLC2POL_POL                   1283
#define LC2POL                        1284
#define CLC2SEL0                      1285
#define CLC2SEL0_D1S                  1286
#define LC2D1S0                       1287
#define CLC2SEL0_D1S0                 1288
#define LC2D1S                        1289
#define LC2D1S1                       1290
#define CLC2SEL0_D1S1                 1291
#define LC2D1S2                       1292
#define CLC2SEL0_D1S2                 1293
#define CLC2SEL0_D1S3                 1294
#define LC2D1S3                       1295
#define LC2D1S4                       1296
#define CLC2SEL0_D1S4                 1297
#define CLC2SEL1                      1298
#define LC2D2S0                       1299
#define CLC2SEL1_D2S0                 1300
#define LC2D2S                        1301
#define CLC2SEL1_D2S                  1302
#define LC2D2S1                       1303
#define CLC2SEL1_D2S1                 1304
#define LC2D2S2                       1305
#define CLC2SEL1_D2S2                 1306
#define LC2D2S3                       1307
#define CLC2SEL1_D2S3                 1308
#define LC2D2S4                       1309
#define CLC2SEL1_D2S4                 1310
#define CLC2SEL2                      1311
#define CLC2SEL2_D3S                  1312
#define LC2D3S0                       1313
#define CLC2SEL2_D3S0                 1314
#define LC2D3S                        1315
#define CLC2SEL2_D3S1                 1316
#define LC2D3S1                       1317
#define LC2D3S2                       1318
#define CLC2SEL2_D3S2                 1319
#define LC2D3S3                       1320
#define CLC2SEL2_D3S3                 1321
#define LC2D3S4                       1322
#define CLC2SEL2_D3S4                 1323
#define CLC2SEL3                      1324
#define LC2D4S                        1325
#define LC2D4S0                       1326
#define CLC2SEL3_D4S                  1327
#define CLC2SEL3_D4S0                 1328
#define LC2D4S1                       1329
#define CLC2SEL3_D4S1                 1330
#define LC2D4S2                       1331
#define CLC2SEL3_D4S2                 1332
#define CLC2SEL3_D4S3                 1333
#define LC2D4S3                       1334
#define LC2D4S4                       1335
#define CLC2SEL3_D4S4                 1336
#define CLC2GLS0                      1337
#define LC2G1D1N                      1338
#define CLC2GLS0_D1N                  1339
#define CLC2GLS0_D1T                  1340
#define LC2G1D1T                      1341
#define LC2G1D2N                      1342
#define CLC2GLS0_D2N                  1343
#define CLC2GLS0_D2T                  1344
#define LC2G1D2T                      1345
#define LC2G1D3N                      1346
#define CLC2GLS0_D3N                  1347
#define CLC2GLS0_D3T                  1348
#define LC2G1D3T                      1349
#define LC2G1D4N                      1350
#define CLC2GLS0_D4N                  1351
#define CLC2GLS0_D4T                  1352
#define LC2G1D4T                      1353
#define CLC2GLS1                      1354
#define CLC2GLS1_D1N                  1355
#define LC2G2D1N                      1356
#define CLC2GLS1_D1T                  1357
#define LC2G2D1T                      1358
#define CLC2GLS1_D2N                  1359
#define LC2G2D2N                      1360
#define CLC2GLS1_D2T                  1361
#define LC2G2D2T                      1362
#define LC2G2D3N                      1363
#define CLC2GLS1_D3N                  1364
#define LC2G2D3T                      1365
#define CLC2GLS1_D3T                  1366
#define LC2G2D4N                      1367
#define CLC2GLS1_D4N                  1368
#define LC2G2D4T                      1369
#define CLC2GLS1_D4T                  1370
#define CLC2GLS2                      1371
#define LC2G3D1N                      1372
#define CLC2GLS2_D1N                  1373
#define CLC2GLS2_D1T                  1374
#define LC2G3D1T                      1375
#define CLC2GLS2_D2N                  1376
#define LC2G3D2N                      1377
#define LC2G3D2T                      1378
#define CLC2GLS2_D2T                  1379
#define CLC2GLS2_D3N                  1380
#define LC2G3D3N                      1381
#define CLC2GLS2_D3T                  1382
#define LC2G3D3T                      1383
#define CLC2GLS2_D4N                  1384
#define LC2G3D4N                      1385
#define LC2G3D4T                      1386
#define CLC2GLS2_D4T                  1387
#define CLC2GLS3                      1388
#define LC2G4D1N                      1389
#define CLC2GLS3_G4D1N                1390
#define CLC2GLS3_G4D1T                1391
#define LC2G4D1T                      1392
#define CLC2GLS3_G4D2N                1393
#define LC2G4D2N                      1394
#define LC2G4D2T                      1395
#define CLC2GLS3_G4D2T                1396
#define CLC2GLS3_G4D3N                1397
#define LC2G4D3N                      1398
#define CLC2GLS3_G4D3T                1399
#define LC2G4D3T                      1400
#define LC2G4D4N                      1401
#define CLC2GLS3_G4D4N                1402
#define CLC2GLS3_G4D4T                1403
#define LC2G4D4T                      1404
#define STATUS_SHAD                   1405
#define C_SHAD                        1406
#define DC_SHAD                       1407
#define Z_SHAD                        1408
#define WREG_SHAD                     1409
#define BSR_SHAD                      1410
#define PCLATH_SHAD                   1411
#define FSR0L_SHAD                    1412
#define FSR0H_SHAD                    1413
#define FSR1L_SHAD                    1414
#define FSR1H_SHAD                    1415
#define STKPTR                        1416
#define TOSL                          1417
#define TOSH                          1418

#endif // _PIC16LF18323_H_
